import random

playerskill = {1: '공격', 2: '가드', 3: '패링'}
PLH = ("| 성공 |", "| 실패 |")
playerHP = 100
pa=15
pg=20
pp=15

bossskill = {1: 'HP회복', 2: '하모슬래시', 3: '조개방패', 4: '회피'}
BH = ("성공", "실패", "실패", "실패")
bossHP = 200
ba=25
bg=10
bh=10
boss_skill = []
bm1=("HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)", "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)", "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)")
bm2=("HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)", "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)", "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)")
bm3=("HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)", "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)", "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)")
bm4=("HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)", "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)", "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)")

print("----------------------------------------------------------------------------------------------------------------------------")
print("< 스 토 리 >")
print()
print("옛날 옛적, 평화로운 마을 JINJOO는 무시무시한 마왕HAMO에 의해 어둠으로 뒤덮였습니다.")
print()
print("마을 사람들은 저주받은 마왕 HAMO의 앞에 비명 소리조차 내지 못하고 무력했습니다.")
print()
print("그러던 어느 날, 무모한 용사 갓다운이 나타났습니다.")
print()
print("그는 사람들의 마음을 이끌어 모아 마왕을 물리치겠다고 맹세했습니다. ")
print()
print("JINJOO마을을 떠나, 갓다운은 마왕의 성으로 향했습니다.")
print()
print("갓다운은 마왕성의 성문 앞에서 크게 호흡을 하고 마왕성으로 들어갔습니다.")
print()
print("용사 갓다운 : 마왕 HAMO!! 나 용사 갓다운이 널 물리치러 왔다!!!!!!!!!!!!")
print("마왕 HAMO : 니가 용사라고?? 홓홓홓홓홓 가소롭구나 어리석은 인간이여....")
print("용사 갓다운 : 에잇 헛소리는 집어치우고 내 칼을 받아라!!!")
print("마왕 HAMO : 그래 여기까지 온 용기는 칭찬해주마, 자! 덤벼라 용사!!!! ")
print("----------------------------------------------------------------------------------------------------------------------------")
print()
print()
print()
print("----------------------------------------------------------------------------------------------------------------------------")
print("<용사 능력치>                                 <마왕 능력치>")
print()
print("이름 : 용사 갓다운                            이름 : 마왕 HOMO")
print("체력 : 100                                    체력 : 200") 
print("공격력 : 15                                   공격력 : 25") 
print("방어력 : 20                                   방어력 : 10") 
print("패링(성공시 반격) : 15 확률50%                회피 : 25%")
print("                                              HP회복 : 5")
print("----------------------------------------------------------------------------------------------------------------------------")
print()
print()
print()
print("----------------------------------------------------------------------------------------------------------------------------")
print("<게임 설명>")
print()
print("1번 - 1, 2, 3을 눌러 용사의 행동을 정해주세요.")
print("2번 - 마왕의 체력을 0으로 만들면 용사는 마왕을 물리칠 수 있습니다.")
print("3번 - 용사의 체력이 0이 되면 용사는 쓰러지게 됩니다.")
print("----------------------------------------------------------------------------------------------------------------------------")
print()
print()
print()
print("그럼, 행운을 빌겠습니다. 부디 마왕을 물리칠 수 있기를......")
print()
print("                   Game Start!!!")
print()
print()
boss_skill = random.choice(list(bossskill.values()))
bm1r=random.choice(bm1)
bm2r=random.choice(bm2)
bm3r=random.choice(bm3)
bm4r=random.choice(bm4)
if boss_skill == "HP회복":
    print("----------------------------------------------------------------------------------------------------------------------------")
    print()
    print(bm1r)
    if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
    elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
    print()
    print("----------------------------------------------------------------------------------------------------------------------------")
elif boss_skill == "하모슬래시":
    print("----------------------------------------------------------------------------------------------------------------------------")
    print()
    print(bm3r)
    if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
    elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
    print()
    print("----------------------------------------------------------------------------------------------------------------------------")
elif boss_skill == "조개방패":
    print("----------------------------------------------------------------------------------------------------------------------------")
    print()
    print(bm2r)
    if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
    elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
    print()
    print("----------------------------------------------------------------------------------------------------------------------------")
elif boss_skill == "회피":
    print("----------------------------------------------------------------------------------------------------------------------------")
    print()
    print(bm4r)
    if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
    elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
    print()
    print("----------------------------------------------------------------------------------------------------------------------------")
while playerHP > 0 and bossHP > 0:
    select = int(input("당신의 턴입니다. 행동을 선택해 주세요.(1:공격, 2:가드, 3:패링)"))
    print()
    if select == 1:
        value = playerskill[1]
        if value == "공격":
            if boss_skill == "HP회복":
                bossHP = bossHP-(pa-bh)
                print("----------------------------------------------------------------------------------------------------------------------------")
                print("-전투 실행-")
                print()
                print("<용사의 행동>")
                print("용사 갓다운이 | {} | 을/를 사용했습니다." .format(playerskill[select]))
                print("<마왕의 행동>")
                print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                print()
                print()
                print()
                print("-전투 결과-")
                print()
                print("<용사의 상태>")
                print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                print("<마왕의 상태>")
                print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                print("----------------------------------------------------------------------------------------------------------------------------")
                print()
                print()
                boss_skill = random.choice(list(bossskill.values()))
                bm1r=random.choice(bm1)
                bm2r=random.choice(bm2)
                bm3r=random.choice(bm3)
                bm4r=random.choice(bm4)
                if boss_skill == "HP회복":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm1r)
                    if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "하모슬래시":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm3r)
                    if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "조개방패":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm2r)
                    if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "회피":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm4r)
                    if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
            elif boss_skill == "하모슬래시":
                playerHP = playerHP-ba
                bossHP = bossHP-pa
                print("----------------------------------------------------------------------------------------------------------------------------")
                print("-전투 실행-")
                print()
                print("<용사의 행동>")
                print("용사 갓다운이 | {} | 을/를 사용했습니다." .format(playerskill[select]))
                print("<마왕의 행동>")
                print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                print()
                print()
                print()
                print("-전투 결과-")
                print()
                print("<용사의 상태>")
                print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                print("<마왕의 상태>")
                print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                print("----------------------------------------------------------------------------------------------------------------------------")
                print()
                print()
                boss_skill = random.choice(list(bossskill.values()))
                bm1r=random.choice(bm1)
                bm2r=random.choice(bm2)
                bm3r=random.choice(bm3)
                bm4r=random.choice(bm4)
                if boss_skill == "HP회복":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm1r)
                    if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "하모슬래시":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm3r)
                    if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "조개방패":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm2r)
                    if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "회피":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm4r)
                    if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
            elif boss_skill == "조개방패":
                bossHP = bossHP-(pa-bg)
                print("----------------------------------------------------------------------------------------------------------------------------")
                print("-전투 실행-")
                print()
                print("<용사의 행동>")
                print("용사 갓다운이 | {} | 을/를 사용했습니다." .format(playerskill[select]))
                print("<마왕의 행동>")
                print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                print()
                print()
                print()
                print("-전투 결과-")
                print()
                print("<용사의 상태>")
                print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                print("<마왕의 상태>")
                print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                print("----------------------------------------------------------------------------------------------------------------------------")
                print()
                print()
                boss_skill = random.choice(list(bossskill.values()))
                bm1r=random.choice(bm1)
                bm2r=random.choice(bm2)
                bm3r=random.choice(bm3)
                bm4r=random.choice(bm4)
                if boss_skill == "HP회복":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm1r)
                    if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "하모슬래시":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm3r)
                    if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "조개방패":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm2r)
                    if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "회피":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm4r)
                    if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
            elif boss_skill == "회피":
                resultB = random.choice(BH)
                if resultB == "성공":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print("-전투 실행-")
                    print()
                    print("<용사의 행동>")
                    print("용사 갓다운이 | {} | 을/를 사용했습니다." .format(playerskill[select]))
                    print("<마왕의 행동>")
                    print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                    print()
                    print()
                    print()
                    print("-전투 결과-")
                    print()
                    print("<용사의 상태>")
                    print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                    print("<마왕의 상태>")
                    print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print()
                    boss_skill = random.choice(list(bossskill.values()))
                    bm1r=random.choice(bm1)
                    bm2r=random.choice(bm2)
                    bm3r=random.choice(bm3)
                    bm4r=random.choice(bm4)
                    if boss_skill == "HP회복":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm1r)
                        if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "하모슬래시":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm3r)
                        if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "조개방패":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm2r)
                        if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "회피":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm4r)
                        if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                elif resultB == "실패":
                    bossHP = bossHP-pa
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print("-전투 실행-")
                    print()
                    print("<용사의 행동>")
                    print("용사 갓다운이 | {} | 을/를 사용했습니다." .format(playerskill[select]))
                    print("<마왕의 행동>")
                    print("마왕 HAMO가 | {} | 을/를 실패하여 넘어졌습니다.".format(boss_skill))
                    print()
                    print()
                    print()
                    print("-전투 결과-")
                    print()
                    print("<용사의 상태>")
                    print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                    print("<마왕의 상태>")
                    print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print()
                    boss_skill = random.choice(list(bossskill.values()))
                    bm1r=random.choice(bm1)
                    bm2r=random.choice(bm2)
                    bm3r=random.choice(bm3)
                    bm4r=random.choice(bm4)
                    if boss_skill == "HP회복":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm1r)
                        if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "하모슬래시":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm3r)
                        if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "조개방패":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm2r)
                        if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "회피":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm4r)
                        if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
    if select == 2:
        value = playerskill[2]
        if value == "가드":
            if boss_skill == "HP회복":
                bossHP = bossHP+bh
                print("----------------------------------------------------------------------------------------------------------------------------")
                print("-전투 실행-")
                print()
                print("<용사의 행동>")
                print("용사 갓다운이 | {} | 을/를 사용했습니다." .format(playerskill[select]))
                print("<마왕의 행동>")
                print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                print()
                print()
                print()
                print("-전투 결과-")
                print()
                print("<용사의 상태>")
                print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                print("<마왕의 상태>")
                print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                print("----------------------------------------------------------------------------------------------------------------------------")
                print()
                print()
                boss_skill = random.choice(list(bossskill.values()))
                bm1r=random.choice(bm1)
                bm2r=random.choice(bm2)
                bm3r=random.choice(bm3)
                bm4r=random.choice(bm4)
                if boss_skill == "HP회복":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm1r)
                    if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "하모슬래시":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm3r)
                    if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "조개방패":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm2r)
                    if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "회피":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm4r)
                    if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
            elif boss_skill == "하모슬래시":
                playerHP = playerHP-(ba-pg)
                print("----------------------------------------------------------------------------------------------------------------------------")
                print("-전투 실행-")
                print()
                print("<용사의 행동>")
                print("용사 갓다운이 | {} | 을/를 사용했습니다." .format(playerskill[select]))
                print("<마왕의 행동>")
                print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                print()
                print()
                print()
                print("-전투 결과-")
                print()
                print("<용사의 상태>")
                print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                print("<마왕의 상태>")
                print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                print("----------------------------------------------------------------------------------------------------------------------------")
                print()
                print()
                boss_skill = random.choice(list(bossskill.values()))
                bm1r=random.choice(bm1)
                bm2r=random.choice(bm2)
                bm3r=random.choice(bm3)
                bm4r=random.choice(bm4)
                if boss_skill == "HP회복":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm1r)
                    if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "하모슬래시":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm3r)
                    if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "조개방패":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm2r)
                    if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "회피":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm4r)
                    if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
            elif boss_skill == "조개방패":
                print("----------------------------------------------------------------------------------------------------------------------------")
                print("-전투 실행-")
                print()
                print("<용사의 행동>")
                print("용사 갓다운이 | {} | 을/를 사용했습니다." .format(playerskill[select]))
                print("<마왕의 행동>")
                print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                print()
                print()
                print()
                print("-전투 결과-")
                print()
                print("<용사의 상태>")
                print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                print("<마왕의 상태>")
                print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                print("----------------------------------------------------------------------------------------------------------------------------")
                print()
                print()
                boss_skill = random.choice(list(bossskill.values()))
                bm1r=random.choice(bm1)
                bm2r=random.choice(bm2)
                bm3r=random.choice(bm3)
                bm4r=random.choice(bm4)
                if boss_skill == "HP회복":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm1r)
                    if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "하모슬래시":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm3r)
                    if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "조개방패":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm2r)
                    if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                    elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
                elif boss_skill == "회피":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print(bm4r)
                    if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                    elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                        print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                    print()
                    print("----------------------------------------------------------------------------------------------------------------------------")
            elif boss_skill == "회피":
                resultB = random.choice(BH)
                if resultB == "성공":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print("-전투 실행-")
                    print()
                    print("<용사의 행동>")
                    print("용사 갓다운이 | {} | 을/를 사용했습니다." .format(playerskill[select]))
                    print("<마왕의 행동>")
                    print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                    print()
                    print()
                    print()
                    print("-전투 결과-")
                    print()
                    print("<용사의 상태>")
                    print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                    print("<마왕의 상태>")
                    print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print()
                    boss_skill = random.choice(list(bossskill.values()))
                    bm1r=random.choice(bm1)
                    bm2r=random.choice(bm2)
                    bm3r=random.choice(bm3)
                    bm4r=random.choice(bm4)
                    if boss_skill == "HP회복":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm1r)
                        if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "하모슬래시":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm3r)
                        if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "조개방패":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm2r)
                        if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "회피":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm4r)
                        if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                elif resultB == "실패":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print("-전투 실행-")
                    print()
                    print("<용사의 행동>")
                    print("용사 갓다운이 | {} | 을/를 사용했습니다." .format(playerskill[select]))
                    print("<마왕의 행동>")
                    print("마왕 HAMO가 | {} | 을/를 실패하여 넘어졌습니다.".format(boss_skill))
                    print()
                    print()
                    print()
                    print("-전투 결과-")
                    print()
                    print("<용사의 상태>")
                    print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                    print("<마왕의 상태>")
                    print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print()
                    boss_skill = random.choice(list(bossskill.values()))
                    bm1r=random.choice(bm1)
                    bm2r=random.choice(bm2)
                    bm3r=random.choice(bm3)
                    bm4r=random.choice(bm4)
                    if boss_skill == "HP회복":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm1r)
                        if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "하모슬래시":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm3r)
                        if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "조개방패":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm2r)
                        if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "회피":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm4r)
                        if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
    if select == 3:
        value = playerskill[3]
        if value == "패링":
            if boss_skill == "HP회복":
                resultP = random.choice(PLH)
                if resultP == "| 성공 |":
                    bossHP = bossHP+bh
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print("-전투 실행-")
                    print()
                    print("<용사의 행동>")
                    print("용사 갓다운이 | {} | 을/를 사용했습니다.".format(playerskill[select]))
                    print("<마왕의 행동>")
                    print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                    print()
                    print()
                    print()
                    print("-전투 결과-")
                    print()
                    print("<용사의 상태>")
                    print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                    print("<마왕의 상태>")
                    print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print()
                    boss_skill = random.choice(list(bossskill.values()))
                    bm1r=random.choice(bm1)
                    bm2r=random.choice(bm2)
                    bm3r=random.choice(bm3)
                    bm4r=random.choice(bm4)
                    if boss_skill == "HP회복":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm1r)
                        if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "하모슬래시":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm3r)
                        if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "조개방패":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm2r)
                        if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "회피":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm4r)
                        if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                elif resultP == "| 실패 |":
                    bossHP = bossHP+bh
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print("-전투 실행-")
                    print()
                    print("<용사의 행동>")
                    print("용사 갓다운이 | {} | 을/를 실패하였습니다.".format(playerskill[select]))
                    print("<마왕의 행동>")
                    print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                    print()
                    print()
                    print()
                    print("-전투 결과-")
                    print()
                    print("<용사의 상태>")
                    print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                    print("<마왕의 상태>")
                    print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print()
                    boss_skill = random.choice(list(bossskill.values()))
                    bm1r=random.choice(bm1)
                    bm2r=random.choice(bm2)
                    bm3r=random.choice(bm3)
                    bm4r=random.choice(bm4)
                    if boss_skill == "HP회복":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm1r)
                        if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "하모슬래시":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm3r)
                        if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "조개방패":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm2r)
                        if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "회피":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm4r)
                        if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
            elif boss_skill == "하모슬래시":
                resultP = random.choice(PLH)
                if resultP == "| 성공 |":
                    bossHP = bossHP-pp
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print("-전투 실행-")
                    print()
                    print("<용사의 행동>")
                    print("용사 갓다운이 | {} | 을/를 사용했습니다.".format(playerskill[select]))
                    print("<마왕의 행동>")
                    print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                    print()
                    print()
                    print()
                    print("-전투 결과-")
                    print()
                    print("<용사의 상태>")
                    print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                    print("<마왕의 상태>")
                    print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print()
                    boss_skill = random.choice(list(bossskill.values()))
                    bm1r=random.choice(bm1)
                    bm2r=random.choice(bm2)
                    bm3r=random.choice(bm3)
                    bm4r=random.choice(bm4)
                    if boss_skill == "HP회복":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm1r)
                        if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "하모슬래시":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm3r)
                        if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "조개방패":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm2r)
                        if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "회피":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm4r)
                        if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                elif resultP == "| 실패 |":
                    playerHP = playerHP-ba
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print("-전투 실행-")
                    print()
                    print("<용사의 행동>")
                    print("용사 갓다운이 | {} | 을/를 실패하였습니다.".format(playerskill[select]))
                    print("<마왕의 행동>")
                    print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                    print()
                    print()
                    print()
                    print("-전투 결과-")
                    print()
                    print("<용사의 상태>")
                    print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                    print("<마왕의 상태>")
                    print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print()
                    boss_skill = random.choice(list(bossskill.values()))
                    bm1r=random.choice(bm1)
                    bm2r=random.choice(bm2)
                    bm3r=random.choice(bm3)
                    bm4r=random.choice(bm4)
                    if boss_skill == "HP회복":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm1r)
                        if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "하모슬래시":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm3r)
                        if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "조개방패":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm2r)
                        if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "회피":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm4r)
                        if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
            elif boss_skill == "조개방패":
                if resultP == "| 성공 |":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print("-전투 실행-")
                    print()
                    print("<용사의 행동>")
                    print("용사 갓다운이 | {} | 을/를 사용했습니다.".format(playerskill[select]))
                    print("<마왕의 행동>")
                    print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                    print()
                    print()
                    print()
                    print("-전투 결과-")
                    print()
                    print("<용사의 상태>")
                    print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                    print("<마왕의 상태>")
                    print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print()
                    boss_skill = random.choice(list(bossskill.values()))
                    bm1r=random.choice(bm1)
                    bm2r=random.choice(bm2)
                    bm3r=random.choice(bm3)
                    bm4r=random.choice(bm4)
                    if boss_skill == "HP회복":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm1r)
                        if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "하모슬래시":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm3r)
                        if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "조개방패":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm2r)
                        if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "회피":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm4r)
                        if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                elif resultP == "| 실패 |":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print("-전투 실행-")
                    print()
                    print("<용사의 행동>")
                    print("용사 갓다운이 | {} | 을/를 실패하였습니다.".format(playerskill[select]))
                    print("<마왕의 행동>")
                    print("마왕 HAMO가 | {} | 을/를 사용했습니다.".format(boss_skill))
                    print()
                    print()
                    print()
                    print("-전투 결과-")
                    print()
                    print("<용사의 상태>")
                    print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                    print("<마왕의 상태>")
                    print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print()
                    boss_skill = random.choice(list(bossskill.values()))
                    bm1r=random.choice(bm1)
                    bm2r=random.choice(bm2)
                    bm3r=random.choice(bm3)
                    bm4r=random.choice(bm4)
                    if boss_skill == "HP회복":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm1r)
                        if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "하모슬래시":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm3r)
                        if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "조개방패":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm2r)
                        if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "회피":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm4r)
                        if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
            elif boss_skill == "회피":
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print("-전투 실행-")
                    print()
                    print("용사 갓다운은 허공에 패링을 하였다.")
                    print("마왕 HAMO는 겁을 먹고 회피를 하였다.")
                    print("용사 갓다운과 마왕 HAMO는 서로를 바라보며 머쓱해했다...")
                    print()
                    print()
                    print()
                    print("-전투 결과-")
                    print()
                    print("<용사의 상태>")
                    print("용사 갓다운의 체력이 | {} | 입니다.".format(playerHP))
                    print("<마왕의 상태>")
                    print("마왕 HAMO의 체력이 | {} | 입니다.".format(bossHP))
                    print("----------------------------------------------------------------------------------------------------------------------------")
                    print()
                    print()
                    boss_skill = random.choice(list(bossskill.values()))
                    bm1r=random.choice(bm1)
                    bm2r=random.choice(bm2)
                    bm3r=random.choice(bm3)
                    bm4r=random.choice(bm4)
                    if boss_skill == "HP회복":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm1r)
                        if bm1r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm1r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "하모슬래시":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm3r)
                        if bm3r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm3r == "HAMO는 크게 숨을 들이마셨다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 숨을 크게 들이쉬면 HAMO는 HP회복 or 하모슬래시를 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "조개방패":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm2r)
                        if bm2r == "HAMO는 꿍꿍이가 있는것 같다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 꿍꿍이가 있어보이면 HAMO는 HP회복 or 조개방패를 사용합니다.")
                        elif bm2r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
                    elif boss_skill == "회피":
                        print("----------------------------------------------------------------------------------------------------------------------------")
                        print()
                        print(bm4r)
                        if bm4r == "HAMO는 눈빛이 날카로워졌다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 눈빛이 날카로워지면 HAMO는 하모슬래시 or 회피를 사용합니다.")
                        elif bm4r == "HAMO는 머리를 긁적인다.(HAMO의 행동을 보고 HOMO의 스킬을 예측해보세요.)":
                            print("HAMO가 머리를 긁으면 HAMO는 조개방패 or HP회복을 사용합니다.")
                        print()
                        print("----------------------------------------------------------------------------------------------------------------------------")
if playerHP <= 0:
    print()
    print("용사의 몸은 차갑게 식어가고 움직이지 않았다.....")
    print()
    print("                You Die")
    print()
else:
    print()
    print("HAMO는 비명을 지르며 쓰러졌다.")
    print()
    print("         You Win")
    print()
